docs: use mermaid graph instead of ascii art
